arduino/ArduinoCore-samd/boards.txt
# Copyright (c) 2014-2017 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

menu.cpu=Microcontroller
menu.clock=Clock Source
menu.usb=USB Config
menu.serial=Serial Config
menu.bootloader=Bootloader Size


# MattairTech Xeno Mini
mattairtech_xeno_mini.name=MattairTech Xeno Mini
mattairtech_xeno_mini.vid.0=0x16D0
mattairtech_xeno_mini.pid.0=0x0557
mattairtech_xeno_mini.vid.1=0x16D0
mattairtech_xeno_mini.pid.1=0x0856
mattairtech_xeno_mini.vid.2=0x16D0
mattairtech_xeno_mini.pid.2=0x0B41
mattairtech_xeno_mini.vid.3=0x16D0
mattairtech_xeno_mini.pid.3=0x0B40
mattairtech_xeno_mini.vid.4=0x16D0
mattairtech_xeno_mini.pid.4=0x0A0C
mattairtech_xeno_mini.vid.5=0x16D0
mattairtech_xeno_mini.pid.5=0x0856
mattairtech_xeno_mini.build.usb_manufacturer="MattairTech LLC"
mattairtech_xeno_mini.build.board=SAMD_ZERO
mattairtech_xeno_mini.build.core=arduino
mattairtech_xeno_mini.build.variant=Xeno_Mini
mattairtech_xeno_mini.build.variant_system_lib=
mattairtech_xeno_mini.build.vid=0x16D0
mattairtech_xeno_mini.upload.protocol=sam-ba
mattairtech_xeno_mini.bootloader.tool=arduino:openocd
mattairtech_xeno_mini.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_xeno_mini.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
mattairtech_xeno_mini.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_xeno_mini.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_xeno_mini.menu.clock.internal=INTERNAL_OSCILLATOR
mattairtech_xeno_mini.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_xeno_mini.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
mattairtech_xeno_mini.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_xeno_mini.menu.cpu.samd21g18a=SAMD21G18A
mattairtech_xeno_mini.menu.cpu.samd21g18a.upload.maximum_size=253952
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.usb_product="Xeno Mini D21"
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.extra_flags=-D__SAMD21G18A__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.ldscript=flash_256KB.ld
mattairtech_xeno_mini.menu.cpu.samd21g18a.build.openocdscript=openocd_scripts/SAMD21G18A.cfg
mattairtech_xeno_mini.menu.cpu.samd21g18a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD21G18A.bin
mattairtech_xeno_mini.menu.cpu.samd21g17a=SAMD21G17A
mattairtech_xeno_mini.menu.cpu.samd21g17a.upload.maximum_size=122880
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.usb_product="Xeno Mini D21"
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.extra_flags=-D__SAMD21G17A__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.ldscript=flash_128KB.ld
mattairtech_xeno_mini.menu.cpu.samd21g17a.build.openocdscript=openocd_scripts/SAMD21G17A.cfg
mattairtech_xeno_mini.menu.cpu.samd21g17a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD21G17A.bin
mattairtech_xeno_mini.menu.cpu.samd21g16a=SAMD21G16A
mattairtech_xeno_mini.menu.cpu.samd21g16a.upload.maximum_size=57344
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.usb_product="Xeno Mini D21"
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.extra_flags=-D__SAMD21G16A__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.ldscript=flash_64KB.ld
mattairtech_xeno_mini.menu.cpu.samd21g16a.build.openocdscript=openocd_scripts/SAMD21G16A.cfg
mattairtech_xeno_mini.menu.cpu.samd21g16a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD21G16A.bin
mattairtech_xeno_mini.menu.cpu.samd21g15a=SAMD21G15A
mattairtech_xeno_mini.menu.cpu.samd21g15a.upload.maximum_size=24576
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.usb_product="Xeno Mini D21"
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.extra_flags=-D__SAMD21G15A__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.ldscript=flash_32KB.ld
mattairtech_xeno_mini.menu.cpu.samd21g15a.build.openocdscript=openocd_scripts/SAMD21G15A.cfg
mattairtech_xeno_mini.menu.cpu.samd21g15a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD21G15A.bin
mattairtech_xeno_mini.menu.cpu.samd51g19a_120=SAMD51G19A_120MHz
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.upload.maximum_size=516096
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.mcu=cortex-m4
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.f_cpu=120000000L
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.usb_product="Xeno Mini D51"
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.extra_flags=-D__SAMD51G19A__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.ldscript=flash_m4f_512KB.ld
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.build.openocdscript=openocd_scripts/SAMD51G19A.cfg
mattairtech_xeno_mini.menu.cpu.samd51g19a_120.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD51G19A.bin
mattairtech_xeno_mini.menu.cpu.samd51g19a_48=SAMD51G19A_48MHz
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.upload.maximum_size=516096
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.mcu=cortex-m4
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.usb_product="Xeno Mini D51"
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.extra_flags=-D__SAMD51G19A__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.ldscript=flash_m4f_512KB.ld
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.build.openocdscript=openocd_scripts/SAMD51G19A.cfg
mattairtech_xeno_mini.menu.cpu.samd51g19a_48.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD51G19A.bin
mattairtech_xeno_mini.menu.cpu.samd51g18a_120=SAMD51G18A_120MHz
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.upload.maximum_size=253952
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.mcu=cortex-m4
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.f_cpu=120000000L
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.usb_product="Xeno Mini D51"
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.extra_flags=-D__SAMD51G18A__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.ldscript=flash_m4f_256KB.ld
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.build.openocdscript=openocd_scripts/SAMD51G18A.cfg
mattairtech_xeno_mini.menu.cpu.samd51g18a_120.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD51G18A.bin
mattairtech_xeno_mini.menu.cpu.samd51g18a_48=SAMD51G18A_48MHz
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.upload.maximum_size=253952
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.mcu=cortex-m4
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.usb_product="Xeno Mini D51"
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.extra_flags=-D__SAMD51G18A__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.ldscript=flash_m4f_256KB.ld
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.build.openocdscript=openocd_scripts/SAMD51G18A.cfg
mattairtech_xeno_mini.menu.cpu.samd51g18a_48.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMD51G18A.bin
mattairtech_xeno_mini.menu.cpu.saml21g18b=SAML21G18B
mattairtech_xeno_mini.menu.cpu.saml21g18b.upload.maximum_size=253952
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.usb_product="Xeno Mini L21"
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.extra_flags=-D__SAML21G18B__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.ldscript=flash_256KB.ld
mattairtech_xeno_mini.menu.cpu.saml21g18b.build.openocdscript=openocd_scripts/SAML21G18B.cfg
mattairtech_xeno_mini.menu.cpu.saml21g18b.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAML21G18B.bin
mattairtech_xeno_mini.menu.cpu.saml21g17b=SAML21G17B
mattairtech_xeno_mini.menu.cpu.saml21g17b.upload.maximum_size=122880
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.usb_product="Xeno Mini L21"
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.extra_flags=-D__SAML21G17B__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.ldscript=flash_128KB.ld
mattairtech_xeno_mini.menu.cpu.saml21g17b.build.openocdscript=openocd_scripts/SAML21G17B.cfg
mattairtech_xeno_mini.menu.cpu.saml21g17b.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAML21G17B.bin
mattairtech_xeno_mini.menu.cpu.saml21g16b=SAML21G16B
mattairtech_xeno_mini.menu.cpu.saml21g16b.upload.maximum_size=57344
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.usb_product="Xeno Mini L21"
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.extra_flags=-D__SAML21G16B__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.ldscript=flash_64KB.ld
mattairtech_xeno_mini.menu.cpu.saml21g16b.build.openocdscript=openocd_scripts/SAML21G16B.cfg
mattairtech_xeno_mini.menu.cpu.saml21g16b.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAML21G16B.bin
mattairtech_xeno_mini.menu.cpu.saml21g15b=SAML21G15B
mattairtech_xeno_mini.menu.cpu.saml21g15b.upload.maximum_size=24576
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.usb_product="Xeno Mini L21"
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.extra_flags=-D__SAML21G15B__ {build.usb_flags}
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.ldscript=flash_32KB.ld
mattairtech_xeno_mini.menu.cpu.saml21g15b.build.openocdscript=openocd_scripts/SAML21G15B.cfg
mattairtech_xeno_mini.menu.cpu.saml21g15b.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAML21G15B.bin
mattairtech_xeno_mini.menu.cpu.samc21g18a=SAMC21G18A
mattairtech_xeno_mini.menu.cpu.samc21g18a.upload.maximum_size=253952
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.usb_product="Xeno Mini C21"
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.extra_flags=-D__SAMC21G18A__
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.ldscript=flash_256KB.ld
mattairtech_xeno_mini.menu.cpu.samc21g18a.build.openocdscript=openocd_scripts/SAMC21G18A.cfg
mattairtech_xeno_mini.menu.cpu.samc21g18a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMC21G18A.bin
mattairtech_xeno_mini.menu.cpu.samc21g17a=SAMC21G17A
mattairtech_xeno_mini.menu.cpu.samc21g17a.upload.maximum_size=122880
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.usb_product="Xeno Mini C21"
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.extra_flags=-D__SAMC21G17A__
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.ldscript=flash_128KB.ld
mattairtech_xeno_mini.menu.cpu.samc21g17a.build.openocdscript=openocd_scripts/SAMC21G17A.cfg
mattairtech_xeno_mini.menu.cpu.samc21g17a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMC21G17A.bin
mattairtech_xeno_mini.menu.cpu.samc21g16a=SAMC21G16A
mattairtech_xeno_mini.menu.cpu.samc21g16a.upload.maximum_size=57344
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.usb_product="Xeno Mini C21"
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.extra_flags=-D__SAMC21G16A__
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.ldscript=flash_64KB.ld
mattairtech_xeno_mini.menu.cpu.samc21g16a.build.openocdscript=openocd_scripts/SAMC21G16A.cfg
mattairtech_xeno_mini.menu.cpu.samc21g16a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMC21G16A.bin
mattairtech_xeno_mini.menu.cpu.samc21g15a=SAMC21G15A
mattairtech_xeno_mini.menu.cpu.samc21g15a.upload.maximum_size=24576
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.mcu=cortex-m0plus
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.f_cpu=48000000L
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.usb_product="Xeno Mini C21"
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.extra_flags=-D__SAMC21G15A__
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.ldscript=flash_32KB.ld
mattairtech_xeno_mini.menu.cpu.samc21g15a.build.openocdscript=openocd_scripts/SAMC21G15A.cfg
mattairtech_xeno_mini.menu.cpu.samc21g15a.bootloader.file=zero/binaries/sam_ba_Xeno_Mini_SAMC21G15A.bin
mattairtech_xeno_mini.menu.bootloader.8kb=8KB_BOOTLOADER
mattairtech_xeno_mini.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
mattairtech_xeno_mini.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
mattairtech_xeno_mini.menu.bootloader.8kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_xeno_mini.menu.bootloader.8kb.upload.use_1200bps_touch=true
mattairtech_xeno_mini.menu.bootloader.8kb.upload.wait_for_upload_port=true
mattairtech_xeno_mini.menu.bootloader.8kb.upload.native_usb=true
mattairtech_xeno_mini.menu.bootloader.16kb=16KB_BOOTLOADER
mattairtech_xeno_mini.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
mattairtech_xeno_mini.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
mattairtech_xeno_mini.menu.bootloader.16kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_xeno_mini.menu.bootloader.16kb.upload.use_1200bps_touch=true
mattairtech_xeno_mini.menu.bootloader.16kb.upload.wait_for_upload_port=true
mattairtech_xeno_mini.menu.bootloader.16kb.upload.native_usb=true
mattairtech_xeno_mini.menu.bootloader.0kb=NO_BOOTLOADER
mattairtech_xeno_mini.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_xeno_mini.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_xeno_mini.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_xeno_mini.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_xeno_mini.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_xeno_mini.menu.bootloader.0kb.upload.native_usb=false
mattairtech_xeno_mini.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_xeno_mini.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.one_uart_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
mattairtech_xeno_mini.menu.serial.one_uart_two_spi.build.serialcom_uart=ONE_UART
mattairtech_xeno_mini.menu.serial.one_uart_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.one_uart_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_xeno_mini.menu.serial.one_uart_two_wire=ONE_UART_TWO_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.one_uart_two_wire.build.serialcom_uart=ONE_UART
mattairtech_xeno_mini.menu.serial.one_uart_two_wire.build.serialcom_wire=TWO_WIRE
mattairtech_xeno_mini.menu.serial.one_uart_two_wire.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_xeno_mini.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.two_uart_two_spi=TWO_UART_ONE_WIRE_TWO_SPI
mattairtech_xeno_mini.menu.serial.two_uart_two_spi.build.serialcom_uart=TWO_UART
mattairtech_xeno_mini.menu.serial.two_uart_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.two_uart_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_xeno_mini.menu.serial.two_uart_two_wire=TWO_UART_TWO_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.two_uart_two_wire.build.serialcom_uart=TWO_UART
mattairtech_xeno_mini.menu.serial.two_uart_two_wire.build.serialcom_wire=TWO_WIRE
mattairtech_xeno_mini.menu.serial.two_uart_two_wire.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.three_uart=THREE_UART_ONE_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.three_uart.build.serialcom_uart=THREE_UART
mattairtech_xeno_mini.menu.serial.three_uart.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.three_uart.build.serialcom_spi=ONE_SPI
mattairtech_xeno_mini.menu.serial.three_uart_two_spi=THREE_UART_ONE_WIRE_TWO_SPI
mattairtech_xeno_mini.menu.serial.three_uart_two_spi.build.serialcom_uart=THREE_UART
mattairtech_xeno_mini.menu.serial.three_uart_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_xeno_mini.menu.serial.three_uart_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_xeno_mini.menu.serial.three_uart_two_wire=THREE_UART_TWO_WIRE_ONE_SPI
mattairtech_xeno_mini.menu.serial.three_uart_two_wire.build.serialcom_uart=THREE_UART
mattairtech_xeno_mini.menu.serial.three_uart_two_wire.build.serialcom_wire=TWO_WIRE
mattairtech_xeno_mini.menu.serial.three_uart_two_wire.build.serialcom_spi=ONE_SPI
