arduino/ArduinoCore-samd/boards.txt
mattairtech_xeno.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_xeno.menu.usb.cdc.build.pid=0x0557
mattairtech_xeno.menu.usb.cdc_hid=CDC_HID
mattairtech_xeno.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_xeno.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_xeno.menu.usb.withcdc=WITH_CDC
mattairtech_xeno.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_xeno.menu.usb.withcdc.build.pid=0x0B41
mattairtech_xeno.menu.usb.hid=HID_ONLY
mattairtech_xeno.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_xeno.menu.usb.hid.build.pid=0x0B40
mattairtech_xeno.menu.usb.nocdc=WITHOUT_CDC
mattairtech_xeno.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_xeno.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_xeno.menu.usb.none=USB_DISABLED
mattairtech_xeno.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_xeno.menu.usb.none.build.pid=0x0856


# MattairTech MT-D21E (rev B)
mattairtech_mt_d21e_revb.name=MattairTech MT-D21E (rev B)
mattairtech_mt_d21e_revb.vid.0=0x16D0
mattairtech_mt_d21e_revb.pid.0=0x0557
mattairtech_mt_d21e_revb.vid.1=0x16D0
mattairtech_mt_d21e_revb.pid.1=0x0856
mattairtech_mt_d21e_revb.vid.2=0x16D0
mattairtech_mt_d21e_revb.pid.2=0x0B41
mattairtech_mt_d21e_revb.vid.3=0x16D0
mattairtech_mt_d21e_revb.pid.3=0x0B40
mattairtech_mt_d21e_revb.vid.4=0x16D0
mattairtech_mt_d21e_revb.pid.4=0x0A0C
mattairtech_mt_d21e_revb.vid.5=0x16D0
mattairtech_mt_d21e_revb.pid.5=0x0856
mattairtech_mt_d21e_revb.build.mcu=cortex-m0plus
mattairtech_mt_d21e_revb.build.f_cpu=48000000L
mattairtech_mt_d21e_revb.build.usb_product="MT-D21E Rev B"
mattairtech_mt_d21e_revb.build.usb_manufacturer="MattairTech LLC"
mattairtech_mt_d21e_revb.build.board=SAMD_ZERO
mattairtech_mt_d21e_revb.build.core=arduino
mattairtech_mt_d21e_revb.build.variant=MT_D21E_revB
mattairtech_mt_d21e_revb.build.variant_system_lib=
mattairtech_mt_d21e_revb.build.vid=0x16D0
mattairtech_mt_d21e_revb.upload.protocol=sam-ba
mattairtech_mt_d21e_revb.bootloader.tool=arduino:openocd
mattairtech_mt_d21e_revb.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_mt_d21e_revb.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
mattairtech_mt_d21e_revb.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_mt_d21e_revb.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_mt_d21e_revb.menu.clock.internal=INTERNAL_OSCILLATOR
mattairtech_mt_d21e_revb.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_mt_d21e_revb.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
mattairtech_mt_d21e_revb.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_mt_d21e_revb.menu.cpu.samd21e18a=SAMD21E18A
mattairtech_mt_d21e_revb.menu.cpu.samd21e18a.upload.maximum_size=253952
mattairtech_mt_d21e_revb.menu.cpu.samd21e18a.build.extra_flags=-D__SAMD21E18A__ {build.usb_flags}
mattairtech_mt_d21e_revb.menu.cpu.samd21e18a.build.ldscript=flash_256KB.ld
mattairtech_mt_d21e_revb.menu.cpu.samd21e18a.build.openocdscript=openocd_scripts/SAMD21E18A.cfg
mattairtech_mt_d21e_revb.menu.cpu.samd21e18a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAMD21E18A.bin
mattairtech_mt_d21e_revb.menu.cpu.samd21e17a=SAMD21E17A
mattairtech_mt_d21e_revb.menu.cpu.samd21e17a.upload.maximum_size=122880
mattairtech_mt_d21e_revb.menu.cpu.samd21e17a.build.extra_flags=-D__SAMD21E17A__ {build.usb_flags}
mattairtech_mt_d21e_revb.menu.cpu.samd21e17a.build.ldscript=flash_128KB.ld
mattairtech_mt_d21e_revb.menu.cpu.samd21e17a.build.openocdscript=openocd_scripts/SAMD21E17A.cfg
mattairtech_mt_d21e_revb.menu.cpu.samd21e17a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAMD21E17A.bin
mattairtech_mt_d21e_revb.menu.cpu.samd21e16a=SAMD21E16A
mattairtech_mt_d21e_revb.menu.cpu.samd21e16a.upload.maximum_size=57344
mattairtech_mt_d21e_revb.menu.cpu.samd21e16a.build.extra_flags=-D__SAMD21E16A__ {build.usb_flags}
mattairtech_mt_d21e_revb.menu.cpu.samd21e16a.build.ldscript=flash_64KB.ld
mattairtech_mt_d21e_revb.menu.cpu.samd21e16a.build.openocdscript=openocd_scripts/SAMD21E16A.cfg
mattairtech_mt_d21e_revb.menu.cpu.samd21e16a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAMD21E16A.bin
mattairtech_mt_d21e_revb.menu.cpu.samd21e15a=SAMD21E15A
mattairtech_mt_d21e_revb.menu.cpu.samd21e15a.upload.maximum_size=24576
mattairtech_mt_d21e_revb.menu.cpu.samd21e15a.build.extra_flags=-D__SAMD21E15A__ {build.usb_flags}
mattairtech_mt_d21e_revb.menu.cpu.samd21e15a.build.ldscript=flash_32KB.ld
mattairtech_mt_d21e_revb.menu.cpu.samd21e15a.build.openocdscript=openocd_scripts/SAMD21E15A.cfg
mattairtech_mt_d21e_revb.menu.cpu.samd21e15a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAMD21E15A.bin
mattairtech_mt_d21e_revb.menu.cpu.saml21e18b=SAML21E18B
mattairtech_mt_d21e_revb.menu.cpu.saml21e18b.upload.maximum_size=253952
mattairtech_mt_d21e_revb.menu.cpu.saml21e18b.build.extra_flags=-D__SAML21E18B__ {build.usb_flags}
mattairtech_mt_d21e_revb.menu.cpu.saml21e18b.build.ldscript=flash_256KB.ld
mattairtech_mt_d21e_revb.menu.cpu.saml21e18b.build.openocdscript=openocd_scripts/SAML21E18B.cfg
mattairtech_mt_d21e_revb.menu.cpu.saml21e18b.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAML21E18B.bin
mattairtech_mt_d21e_revb.menu.cpu.saml21e17b=SAML21E17B
mattairtech_mt_d21e_revb.menu.cpu.saml21e17b.upload.maximum_size=122880
mattairtech_mt_d21e_revb.menu.cpu.saml21e17b.build.extra_flags=-D__SAML21E17B__ {build.usb_flags}
mattairtech_mt_d21e_revb.menu.cpu.saml21e17b.build.ldscript=flash_128KB.ld
mattairtech_mt_d21e_revb.menu.cpu.saml21e17b.build.openocdscript=openocd_scripts/SAML21E17B.cfg
mattairtech_mt_d21e_revb.menu.cpu.saml21e17b.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAML21E17B.bin
mattairtech_mt_d21e_revb.menu.cpu.saml21e16b=SAML21E16B
mattairtech_mt_d21e_revb.menu.cpu.saml21e16b.upload.maximum_size=57344
mattairtech_mt_d21e_revb.menu.cpu.saml21e16b.build.extra_flags=-D__SAML21E16B__ {build.usb_flags}
mattairtech_mt_d21e_revb.menu.cpu.saml21e16b.build.ldscript=flash_64KB.ld
mattairtech_mt_d21e_revb.menu.cpu.saml21e16b.build.openocdscript=openocd_scripts/SAML21E16B.cfg
mattairtech_mt_d21e_revb.menu.cpu.saml21e16b.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAML21E16B.bin
mattairtech_mt_d21e_revb.menu.cpu.saml21e15b=SAML21E15B
mattairtech_mt_d21e_revb.menu.cpu.saml21e15b.upload.maximum_size=24576
mattairtech_mt_d21e_revb.menu.cpu.saml21e15b.build.extra_flags=-D__SAML21E15B__ {build.usb_flags}
mattairtech_mt_d21e_revb.menu.cpu.saml21e15b.build.ldscript=flash_32KB.ld
mattairtech_mt_d21e_revb.menu.cpu.saml21e15b.build.openocdscript=openocd_scripts/SAML21E15B.cfg
mattairtech_mt_d21e_revb.menu.cpu.saml21e15b.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAML21E15B.bin
mattairtech_mt_d21e_revb.menu.cpu.samc21e18a=SAMC21E18A
mattairtech_mt_d21e_revb.menu.cpu.samc21e18a.upload.maximum_size=253952
mattairtech_mt_d21e_revb.menu.cpu.samc21e18a.build.extra_flags=-D__SAMC21E18A__
mattairtech_mt_d21e_revb.menu.cpu.samc21e18a.build.ldscript=flash_256KB.ld
mattairtech_mt_d21e_revb.menu.cpu.samc21e18a.build.openocdscript=openocd_scripts/SAMC21E18A.cfg
mattairtech_mt_d21e_revb.menu.cpu.samc21e18a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAMC21E18A.bin
mattairtech_mt_d21e_revb.menu.cpu.samc21e17a=SAMC21E17A
mattairtech_mt_d21e_revb.menu.cpu.samc21e17a.upload.maximum_size=122880
mattairtech_mt_d21e_revb.menu.cpu.samc21e17a.build.extra_flags=-D__SAMC21E17A__
mattairtech_mt_d21e_revb.menu.cpu.samc21e17a.build.ldscript=flash_128KB.ld
mattairtech_mt_d21e_revb.menu.cpu.samc21e17a.build.openocdscript=openocd_scripts/SAMC21E17A.cfg
mattairtech_mt_d21e_revb.menu.cpu.samc21e17a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAMC21E17A.bin
mattairtech_mt_d21e_revb.menu.cpu.samc21e16a=SAMC21E16A
mattairtech_mt_d21e_revb.menu.cpu.samc21e16a.upload.maximum_size=57344
mattairtech_mt_d21e_revb.menu.cpu.samc21e16a.build.extra_flags=-D__SAMC21E16A__
mattairtech_mt_d21e_revb.menu.cpu.samc21e16a.build.ldscript=flash_64KB.ld
mattairtech_mt_d21e_revb.menu.cpu.samc21e16a.build.openocdscript=openocd_scripts/SAMC21E16A.cfg
mattairtech_mt_d21e_revb.menu.cpu.samc21e16a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAMC21E16A.bin
mattairtech_mt_d21e_revb.menu.cpu.samc21e15a=SAMC21E15A
mattairtech_mt_d21e_revb.menu.cpu.samc21e15a.upload.maximum_size=24576
mattairtech_mt_d21e_revb.menu.cpu.samc21e15a.build.extra_flags=-D__SAMC21E15A__
mattairtech_mt_d21e_revb.menu.cpu.samc21e15a.build.ldscript=flash_32KB.ld
mattairtech_mt_d21e_revb.menu.cpu.samc21e15a.build.openocdscript=openocd_scripts/SAMC21E15A.cfg
mattairtech_mt_d21e_revb.menu.cpu.samc21e15a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_B_SAMC21E15A.bin
mattairtech_mt_d21e_revb.menu.bootloader.8kb=8KB_BOOTLOADER
mattairtech_mt_d21e_revb.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
mattairtech_mt_d21e_revb.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
mattairtech_mt_d21e_revb.menu.bootloader.8kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d21e_revb.menu.bootloader.8kb.upload.use_1200bps_touch=true
mattairtech_mt_d21e_revb.menu.bootloader.8kb.upload.wait_for_upload_port=true
mattairtech_mt_d21e_revb.menu.bootloader.8kb.upload.native_usb=true
mattairtech_mt_d21e_revb.menu.bootloader.16kb=16KB_BOOTLOADER
mattairtech_mt_d21e_revb.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
mattairtech_mt_d21e_revb.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
mattairtech_mt_d21e_revb.menu.bootloader.16kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d21e_revb.menu.bootloader.16kb.upload.use_1200bps_touch=true
mattairtech_mt_d21e_revb.menu.bootloader.16kb.upload.wait_for_upload_port=true
mattairtech_mt_d21e_revb.menu.bootloader.16kb.upload.native_usb=true
mattairtech_mt_d21e_revb.menu.bootloader.0kb=NO_BOOTLOADER
mattairtech_mt_d21e_revb.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_mt_d21e_revb.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_mt_d21e_revb.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_mt_d21e_revb.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_mt_d21e_revb.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_mt_d21e_revb.menu.bootloader.0kb.upload.native_usb=false
mattairtech_mt_d21e_revb.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e_revb.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.one_uart_one_wire_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
mattairtech_mt_d21e_revb.menu.serial.one_uart_one_wire_two_spi.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e_revb.menu.serial.one_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.one_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_mt_d21e_revb.menu.serial.one_uart_two_wire_one_spi=ONE_UART_TWO_WIRE_ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.one_uart_two_wire_one_spi.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e_revb.menu.serial.one_uart_two_wire_one_spi.build.serialcom_wire=TWO_WIRE
mattairtech_mt_d21e_revb.menu.serial.one_uart_two_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_mt_d21e_revb.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.three_uart_one_wire_no_spi=THREE_UART_ONE_WIRE_NO_SPI
mattairtech_mt_d21e_revb.menu.serial.three_uart_one_wire_no_spi.build.serialcom_uart=THREE_UART
mattairtech_mt_d21e_revb.menu.serial.three_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.three_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e_revb.menu.serial.three_uart_no_wire_one_spi=THREE_UART_NO_WIRE_ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.three_uart_no_wire_one_spi.build.serialcom_uart=THREE_UART
mattairtech_mt_d21e_revb.menu.serial.three_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e_revb.menu.serial.three_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.four_uart=FOUR_UART_NO_WIRE_NO_SPI
mattairtech_mt_d21e_revb.menu.serial.four_uart.build.serialcom_uart=FOUR_UART
mattairtech_mt_d21e_revb.menu.serial.four_uart.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e_revb.menu.serial.four_uart.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e_revb.menu.serial.no_uart_one_wire_two_spi=NO_UART_ONE_WIRE_TWO_SPI
mattairtech_mt_d21e_revb.menu.serial.no_uart_one_wire_two_spi.build.serialcom_uart=NO_UART
mattairtech_mt_d21e_revb.menu.serial.no_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.no_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_mt_d21e_revb.menu.serial.four_uart_one_wire_one_spi=FOUR_UART_ONE_WIRE_ONE_SPI (L21 only)
mattairtech_mt_d21e_revb.menu.serial.four_uart_one_wire_one_spi.build.serialcom_uart=FOUR_UART
mattairtech_mt_d21e_revb.menu.serial.four_uart_one_wire_one_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.four_uart_one_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.five_uart_no_wire_one_spi=FIVE_UART_NO_WIRE_ONE_SPI (L21 only)
mattairtech_mt_d21e_revb.menu.serial.five_uart_no_wire_one_spi.build.serialcom_uart=FIVE_UART
mattairtech_mt_d21e_revb.menu.serial.five_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e_revb.menu.serial.five_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e_revb.menu.serial.five_uart_one_wire_no_spi=FIVE_UART_ONE_WIRE_NO_SPI (L21 only)
mattairtech_mt_d21e_revb.menu.serial.five_uart_one_wire_no_spi.build.serialcom_uart=FIVE_UART
mattairtech_mt_d21e_revb.menu.serial.five_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e_revb.menu.serial.five_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e_revb.menu.serial.six_uart=SIX_UART_NO_WIRE_NO_SPI (L21 only)
mattairtech_mt_d21e_revb.menu.serial.six_uart.build.serialcom_uart=SIX_UART
mattairtech_mt_d21e_revb.menu.serial.six_uart.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e_revb.menu.serial.six_uart.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e_revb.menu.usb.cdc=CDC_ONLY
mattairtech_mt_d21e_revb.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_mt_d21e_revb.menu.usb.cdc.build.pid=0x0557
mattairtech_mt_d21e_revb.menu.usb.cdc_hid=CDC_HID
mattairtech_mt_d21e_revb.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_mt_d21e_revb.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_mt_d21e_revb.menu.usb.withcdc=WITH_CDC
mattairtech_mt_d21e_revb.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_mt_d21e_revb.menu.usb.withcdc.build.pid=0x0B41
mattairtech_mt_d21e_revb.menu.usb.hid=HID_ONLY
mattairtech_mt_d21e_revb.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_mt_d21e_revb.menu.usb.hid.build.pid=0x0B40
mattairtech_mt_d21e_revb.menu.usb.nocdc=WITHOUT_CDC
mattairtech_mt_d21e_revb.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_mt_d21e_revb.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_mt_d21e_revb.menu.usb.none=USB_DISABLED
mattairtech_mt_d21e_revb.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_mt_d21e_revb.menu.usb.none.build.pid=0x0856


