arduino/ArduinoCore-samd/boards.txt
# MattairTech MT-D21E
mattairtech_mt_d21e.name=MattairTech MT-D21E (rev A)
mattairtech_mt_d21e.vid.0=0x16D0
mattairtech_mt_d21e.pid.0=0x0557
mattairtech_mt_d21e.vid.1=0x16D0
mattairtech_mt_d21e.pid.1=0x0856
mattairtech_mt_d21e.vid.2=0x16D0
mattairtech_mt_d21e.pid.2=0x0B41
mattairtech_mt_d21e.vid.3=0x16D0
mattairtech_mt_d21e.pid.3=0x0B40
mattairtech_mt_d21e.vid.4=0x16D0
mattairtech_mt_d21e.pid.4=0x0A0C
mattairtech_mt_d21e.vid.5=0x16D0
mattairtech_mt_d21e.pid.5=0x0856
mattairtech_mt_d21e.build.mcu=cortex-m0plus
mattairtech_mt_d21e.build.f_cpu=48000000L
mattairtech_mt_d21e.build.usb_product="MT-D21E Rev A"
mattairtech_mt_d21e.build.usb_manufacturer="MattairTech LLC"
mattairtech_mt_d21e.build.board=SAMD_ZERO
mattairtech_mt_d21e.build.core=arduino
mattairtech_mt_d21e.build.variant=MT_D21E
mattairtech_mt_d21e.build.variant_system_lib=
mattairtech_mt_d21e.build.vid=0x16D0
mattairtech_mt_d21e.upload.protocol=sam-ba
mattairtech_mt_d21e.bootloader.tool=arduino:openocd
mattairtech_mt_d21e.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_mt_d21e.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
mattairtech_mt_d21e.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_mt_d21e.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_mt_d21e.menu.clock.internal=INTERNAL_OSCILLATOR
mattairtech_mt_d21e.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_mt_d21e.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
mattairtech_mt_d21e.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_mt_d21e.menu.cpu.samd21e18a=SAMD21E18A
mattairtech_mt_d21e.menu.cpu.samd21e18a.upload.maximum_size=253952
mattairtech_mt_d21e.menu.cpu.samd21e18a.build.extra_flags=-D__SAMD21E18A__ {build.usb_flags}
mattairtech_mt_d21e.menu.cpu.samd21e18a.build.ldscript=flash_256KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e18a.build.openocdscript=openocd_scripts/SAMD21E18A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e18a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_A_SAMD21E18A.bin
mattairtech_mt_d21e.menu.cpu.samd21e17a=SAMD21E17A
mattairtech_mt_d21e.menu.cpu.samd21e17a.upload.maximum_size=122880
mattairtech_mt_d21e.menu.cpu.samd21e17a.build.extra_flags=-D__SAMD21E17A__ {build.usb_flags}
mattairtech_mt_d21e.menu.cpu.samd21e17a.build.ldscript=flash_128KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e17a.build.openocdscript=openocd_scripts/SAMD21E17A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e17a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_A_SAMD21E17A.bin
mattairtech_mt_d21e.menu.cpu.samd21e16a=SAMD21E16A
mattairtech_mt_d21e.menu.cpu.samd21e16a.upload.maximum_size=57344
mattairtech_mt_d21e.menu.cpu.samd21e16a.build.extra_flags=-D__SAMD21E16A__ {build.usb_flags}
mattairtech_mt_d21e.menu.cpu.samd21e16a.build.ldscript=flash_64KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e16a.build.openocdscript=openocd_scripts/SAMD21E16A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e16a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_A_SAMD21E16A.bin
mattairtech_mt_d21e.menu.cpu.samd21e15a=SAMD21E15A
mattairtech_mt_d21e.menu.cpu.samd21e15a.upload.maximum_size=24576
mattairtech_mt_d21e.menu.cpu.samd21e15a.build.extra_flags=-D__SAMD21E15A__ {build.usb_flags}
mattairtech_mt_d21e.menu.cpu.samd21e15a.build.ldscript=flash_32KB.ld
mattairtech_mt_d21e.menu.cpu.samd21e15a.build.openocdscript=openocd_scripts/SAMD21E15A.cfg
mattairtech_mt_d21e.menu.cpu.samd21e15a.bootloader.file=zero/binaries/sam_ba_MT_D21E_rev_A_SAMD21E15A.bin
mattairtech_mt_d21e.menu.bootloader.8kb=8KB_BOOTLOADER
mattairtech_mt_d21e.menu.bootloader.8kb.build.bootloader_size=__8KB_BOOTLOADER__
mattairtech_mt_d21e.menu.bootloader.8kb.build.ldscript_path=linker_scripts/gcc/8KB_Bootloader
mattairtech_mt_d21e.menu.bootloader.8kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d21e.menu.bootloader.8kb.upload.use_1200bps_touch=true
mattairtech_mt_d21e.menu.bootloader.8kb.upload.wait_for_upload_port=true
mattairtech_mt_d21e.menu.bootloader.8kb.upload.native_usb=true
mattairtech_mt_d21e.menu.bootloader.16kb=16KB_BOOTLOADER
mattairtech_mt_d21e.menu.bootloader.16kb.build.bootloader_size=__16KB_BOOTLOADER__
mattairtech_mt_d21e.menu.bootloader.16kb.build.ldscript_path=linker_scripts/gcc/16KB_Bootloader
mattairtech_mt_d21e.menu.bootloader.16kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d21e.menu.bootloader.16kb.upload.use_1200bps_touch=true
mattairtech_mt_d21e.menu.bootloader.16kb.upload.wait_for_upload_port=true
mattairtech_mt_d21e.menu.bootloader.16kb.upload.native_usb=true
mattairtech_mt_d21e.menu.bootloader.0kb=NO_BOOTLOADER
mattairtech_mt_d21e.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_mt_d21e.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_mt_d21e.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_mt_d21e.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_mt_d21e.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_mt_d21e.menu.bootloader.0kb.upload.native_usb=false
mattairtech_mt_d21e.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.serial.one_uart_one_wire_two_spi=ONE_UART_ONE_WIRE_TWO_SPI
mattairtech_mt_d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.one_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_mt_d21e.menu.serial.one_uart_two_wire_one_spi=ONE_UART_TWO_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_uart=ONE_UART
mattairtech_mt_d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_wire=TWO_WIRE
mattairtech_mt_d21e.menu.serial.one_uart_two_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.serial.two_uart=TWO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_mt_d21e.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.two_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.serial.three_uart_one_wire_no_spi=THREE_UART_ONE_WIRE_NO_SPI
mattairtech_mt_d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_uart=THREE_UART
mattairtech_mt_d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.three_uart_one_wire_no_spi.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e.menu.serial.three_uart_no_wire_one_spi=THREE_UART_NO_WIRE_ONE_SPI
mattairtech_mt_d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_uart=THREE_UART
mattairtech_mt_d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e.menu.serial.three_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
mattairtech_mt_d21e.menu.serial.four_uart=FOUR_UART_NO_WIRE_NO_SPI
mattairtech_mt_d21e.menu.serial.four_uart.build.serialcom_uart=FOUR_UART
mattairtech_mt_d21e.menu.serial.four_uart.build.serialcom_wire=NO_WIRE
mattairtech_mt_d21e.menu.serial.four_uart.build.serialcom_spi=NO_SPI
mattairtech_mt_d21e.menu.serial.no_uart_one_wire_two_spi=NO_UART_ONE_WIRE_TWO_SPI
mattairtech_mt_d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_uart=NO_UART
mattairtech_mt_d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d21e.menu.serial.no_uart_one_wire_two_spi.build.serialcom_spi=TWO_SPI
mattairtech_mt_d21e.menu.usb.cdc=CDC_ONLY
mattairtech_mt_d21e.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_mt_d21e.menu.usb.cdc.build.pid=0x0557
mattairtech_mt_d21e.menu.usb.cdc_hid=CDC_HID
mattairtech_mt_d21e.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_mt_d21e.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_mt_d21e.menu.usb.withcdc=WITH_CDC
mattairtech_mt_d21e.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_mt_d21e.menu.usb.withcdc.build.pid=0x0B41
mattairtech_mt_d21e.menu.usb.hid=HID_ONLY
mattairtech_mt_d21e.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_mt_d21e.menu.usb.hid.build.pid=0x0B40
mattairtech_mt_d21e.menu.usb.nocdc=WITHOUT_CDC
mattairtech_mt_d21e.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_mt_d21e.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_mt_d21e.menu.usb.none=USB_DISABLED
mattairtech_mt_d21e.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_mt_d21e.menu.usb.none.build.pid=0x0856


# MattairTech MT-D11 (D11D14AM, QFN-24)
mattairtech_mt_d11.name=MattairTech MT-D11
mattairtech_mt_d11.vid.0=0x16D0
mattairtech_mt_d11.pid.0=0x0557
mattairtech_mt_d11.vid.1=0x16D0
mattairtech_mt_d11.pid.1=0x0856
mattairtech_mt_d11.vid.2=0x16D0
mattairtech_mt_d11.pid.2=0x0B41
mattairtech_mt_d11.vid.3=0x16D0
mattairtech_mt_d11.pid.3=0x0B40
mattairtech_mt_d11.vid.4=0x16D0
mattairtech_mt_d11.pid.4=0x0A0C
mattairtech_mt_d11.vid.5=0x16D0
mattairtech_mt_d11.pid.5=0x0856
mattairtech_mt_d11.build.mcu=cortex-m0plus
mattairtech_mt_d11.build.f_cpu=48000000L
mattairtech_mt_d11.build.usb_product="MT-D11"
mattairtech_mt_d11.build.usb_manufacturer="MattairTech LLC"
mattairtech_mt_d11.build.board=SAMD_ZERO
mattairtech_mt_d11.build.core=arduino
mattairtech_mt_d11.build.variant=MT_D11
mattairtech_mt_d11.build.variant_system_lib=
mattairtech_mt_d11.build.vid=0x16D0
mattairtech_mt_d11.upload.protocol=sam-ba
mattairtech_mt_d11.bootloader.tool=arduino:openocd
mattairtech_mt_d11.menu.clock.crystal_32k=32KHZ_CRYSTAL
mattairtech_mt_d11.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
mattairtech_mt_d11.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
mattairtech_mt_d11.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
mattairtech_mt_d11.menu.clock.internal=INTERNAL_OSCILLATOR
mattairtech_mt_d11.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
mattairtech_mt_d11.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
mattairtech_mt_d11.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
mattairtech_mt_d11.build.extra_flags=-D__SAMD11D14AM__ {build.usb_flags}
mattairtech_mt_d11.build.ldscript=flash_16KB.ld
mattairtech_mt_d11.build.openocdscript=openocd_scripts/SAMD11D14AM.cfg
mattairtech_mt_d11.bootloader.file=zero/binaries/sam_ba_MT_D11_SAMD11D14AM.bin
mattairtech_mt_d11.menu.bootloader.4kb=4KB_BOOTLOADER
mattairtech_mt_d11.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
mattairtech_mt_d11.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
mattairtech_mt_d11.menu.bootloader.4kb.upload.tool=MattairTech_Arduino:bossac
mattairtech_mt_d11.menu.bootloader.4kb.upload.use_1200bps_touch=true
mattairtech_mt_d11.menu.bootloader.4kb.upload.wait_for_upload_port=true
mattairtech_mt_d11.menu.bootloader.4kb.upload.native_usb=true
mattairtech_mt_d11.menu.bootloader.4kb.upload.maximum_size=12288
mattairtech_mt_d11.menu.bootloader.0kb=NO_BOOTLOADER
mattairtech_mt_d11.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
mattairtech_mt_d11.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
mattairtech_mt_d11.menu.bootloader.0kb.upload.tool=arduino:openocd
mattairtech_mt_d11.menu.bootloader.0kb.upload.use_1200bps_touch=false
mattairtech_mt_d11.menu.bootloader.0kb.upload.wait_for_upload_port=false
mattairtech_mt_d11.menu.bootloader.0kb.upload.native_usb=false
mattairtech_mt_d11.menu.bootloader.0kb.upload.maximum_size=16384
mattairtech_mt_d11.menu.serial.one_uart=ONE_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d11.menu.serial.one_uart.build.serialcom_uart=ONE_UART
mattairtech_mt_d11.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d11.menu.serial.one_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d11.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
mattairtech_mt_d11.menu.serial.no_uart.build.serialcom_uart=NO_UART
mattairtech_mt_d11.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d11.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
mattairtech_mt_d11.menu.serial.two_uart=TWO_UART_ONE_WIRE_NO_SPI
mattairtech_mt_d11.menu.serial.two_uart.build.serialcom_uart=TWO_UART
mattairtech_mt_d11.menu.serial.two_uart.build.serialcom_wire=ONE_WIRE
mattairtech_mt_d11.menu.serial.two_uart.build.serialcom_spi=NO_SPI
mattairtech_mt_d11.menu.usb.cdc=CDC_ONLY
mattairtech_mt_d11.menu.usb.cdc.build.usbcom=CDC_ONLY
mattairtech_mt_d11.menu.usb.cdc.build.pid=0x0557
mattairtech_mt_d11.menu.usb.cdc_hid=CDC_HID
mattairtech_mt_d11.menu.usb.cdc_hid.build.usbcom=CDC_HID
mattairtech_mt_d11.menu.usb.cdc_hid.build.pid=0x0856
mattairtech_mt_d11.menu.usb.withcdc=WITH_CDC
mattairtech_mt_d11.menu.usb.withcdc.build.usbcom=WITH_CDC
mattairtech_mt_d11.menu.usb.withcdc.build.pid=0x0B41
mattairtech_mt_d11.menu.usb.hid=HID_ONLY
mattairtech_mt_d11.menu.usb.hid.build.usbcom=HID_ONLY
mattairtech_mt_d11.menu.usb.hid.build.pid=0x0B40
mattairtech_mt_d11.menu.usb.nocdc=WITHOUT_CDC
mattairtech_mt_d11.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
mattairtech_mt_d11.menu.usb.nocdc.build.pid=0x0A0C
mattairtech_mt_d11.menu.usb.none=USB_DISABLED
mattairtech_mt_d11.menu.usb.none.build.usbcom=USB_DISABLED
mattairtech_mt_d11.menu.usb.none.build.pid=0x0856


# Generic D11C14A (SOIC-14)
d11c14a.name=Generic D11C14A
d11c14a.vid.0=0x16D0
d11c14a.pid.0=0x0557
d11c14a.vid.1=0x16D0
d11c14a.pid.1=0x0856
d11c14a.vid.2=0x16D0
d11c14a.pid.2=0x0B41
d11c14a.vid.3=0x16D0
d11c14a.pid.3=0x0B40
d11c14a.vid.4=0x16D0
d11c14a.pid.4=0x0A0C
d11c14a.vid.5=0x16D0
d11c14a.pid.5=0x0856
d11c14a.build.mcu=cortex-m0plus
d11c14a.build.f_cpu=48000000L
d11c14a.build.usb_product="D11C14A"
d11c14a.build.usb_manufacturer="MattairTech LLC"
d11c14a.build.board=SAMD_ZERO
d11c14a.build.core=arduino
d11c14a.build.variant=Generic_D11C14A
d11c14a.build.variant_system_lib=
d11c14a.build.vid=0x16D0
d11c14a.upload.protocol=sam-ba
d11c14a.bootloader.tool=arduino:openocd
d11c14a.menu.clock.internal_usb=INTERNAL_USB_CALIBRATED_OSCILLATOR
d11c14a.menu.clock.internal_usb.build.clockconfig=CLOCKCONFIG_INTERNAL_USB
d11c14a.menu.clock.internal=INTERNAL_OSCILLATOR
d11c14a.menu.clock.internal.build.clockconfig=CLOCKCONFIG_INTERNAL
d11c14a.menu.clock.crystal_32k=32KHZ_CRYSTAL
d11c14a.menu.clock.crystal_32k.build.clockconfig=CLOCKCONFIG_32768HZ_CRYSTAL
d11c14a.menu.clock.crystal_hs=HIGH_SPEED_CRYSTAL
d11c14a.menu.clock.crystal_hs.build.clockconfig=CLOCKCONFIG_HS_CRYSTAL
d11c14a.build.extra_flags=-D__SAMD11C14A__ {build.usb_flags}
d11c14a.build.ldscript=flash_16KB.ld
d11c14a.build.openocdscript=openocd_scripts/SAMD11C14A.cfg
d11c14a.bootloader.file=zero/binaries/sam_ba_Generic_D11C14A_SAMD11C14A.bin
d11c14a.menu.bootloader.4kb=4KB_BOOTLOADER
d11c14a.menu.bootloader.4kb.build.bootloader_size=__4KB_BOOTLOADER__
d11c14a.menu.bootloader.4kb.build.ldscript_path=linker_scripts/gcc/4KB_Bootloader
d11c14a.menu.bootloader.4kb.upload.tool=MattairTech_Arduino:bossac
d11c14a.menu.bootloader.4kb.upload.use_1200bps_touch=true
d11c14a.menu.bootloader.4kb.upload.wait_for_upload_port=true
d11c14a.menu.bootloader.4kb.upload.native_usb=true
d11c14a.menu.bootloader.4kb.upload.maximum_size=12288
d11c14a.menu.bootloader.0kb=NO_BOOTLOADER
d11c14a.menu.bootloader.0kb.build.bootloader_size=__NO_BOOTLOADER__
d11c14a.menu.bootloader.0kb.build.ldscript_path=linker_scripts/gcc/No_Bootloader
d11c14a.menu.bootloader.0kb.upload.tool=arduino:openocd
d11c14a.menu.bootloader.0kb.upload.use_1200bps_touch=false
d11c14a.menu.bootloader.0kb.upload.wait_for_upload_port=false
d11c14a.menu.bootloader.0kb.upload.native_usb=false
d11c14a.menu.bootloader.0kb.upload.maximum_size=16384
d11c14a.menu.serial.one_uart=ONE_UART_ONE_WIRE_NO_SPI
d11c14a.menu.serial.one_uart.build.serialcom_uart=ONE_UART
d11c14a.menu.serial.one_uart.build.serialcom_wire=ONE_WIRE
d11c14a.menu.serial.one_uart.build.serialcom_spi=NO_SPI
d11c14a.menu.serial.two_uart=TWO_UART_NO_WIRE_NO_SPI
d11c14a.menu.serial.two_uart.build.serialcom_uart=TWO_UART
d11c14a.menu.serial.two_uart.build.serialcom_wire=NO_WIRE
d11c14a.menu.serial.two_uart.build.serialcom_spi=NO_SPI
d11c14a.menu.serial.one_uart_no_wire_one_spi=ONE_UART_NO_WIRE_ONE_SPI
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_uart=ONE_UART
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_wire=NO_WIRE
d11c14a.menu.serial.one_uart_no_wire_one_spi.build.serialcom_spi=ONE_SPI
d11c14a.menu.serial.no_uart=NO_UART_ONE_WIRE_ONE_SPI
d11c14a.menu.serial.no_uart.build.serialcom_uart=NO_UART
d11c14a.menu.serial.no_uart.build.serialcom_wire=ONE_WIRE
d11c14a.menu.serial.no_uart.build.serialcom_spi=ONE_SPI
d11c14a.menu.usb.cdc=CDC_ONLY
d11c14a.menu.usb.cdc.build.usbcom=CDC_ONLY
d11c14a.menu.usb.cdc.build.pid=0x0557
d11c14a.menu.usb.cdc_hid=CDC_HID
d11c14a.menu.usb.cdc_hid.build.usbcom=CDC_HID
d11c14a.menu.usb.cdc_hid.build.pid=0x0856
d11c14a.menu.usb.withcdc=WITH_CDC
d11c14a.menu.usb.withcdc.build.usbcom=WITH_CDC
d11c14a.menu.usb.withcdc.build.pid=0x0B41
d11c14a.menu.usb.hid=HID_ONLY
d11c14a.menu.usb.hid.build.usbcom=HID_ONLY
d11c14a.menu.usb.hid.build.pid=0x0B40
d11c14a.menu.usb.nocdc=WITHOUT_CDC
d11c14a.menu.usb.nocdc.build.usbcom=WITHOUT_CDC
d11c14a.menu.usb.nocdc.build.pid=0x0A0C
d11c14a.menu.usb.none=USB_DISABLED
d11c14a.menu.usb.none.build.usbcom=USB_DISABLED
d11c14a.menu.usb.none.build.pid=0x0856


